interThermalPhaseFoam/tutorials/NusseltSmooth/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//For m4 preprocessing




//Some dimensions here
;       //Film region thickness
;        //Thickness of the inlet vane
;        //Height of the inlet vane
;         //Bulk section height
;        //Thickness of the bulk section
//Discretization params
;         //Normal direction resolution
;		//Normal direction resolution in the bulk
;           //Length-direction resolution

convertToMeters 1;

vertices        
(
	//Back face
	(0                    0                  0)           //00
	(16.72E-5                   0                  0)           //01
	(0.0002172         0                  0)           //02
	(0.0027172     0                  0)           //03
	(0                    2.5E-2                 0)           //04
	(16.72E-5                   2.5E-2                 0)           //05
	(0.0002172         2.5E-2                 0)           //06
	(0.0027172     2.5E-2                 0)           //07
	(0                    0.02525        0)           //08
	(16.72E-5                   0.02525        0)           //09
	//Front face
	(0                    0                  16.72E-5)          //10
	(16.72E-5                   0                  16.72E-5)          //11
	(0.0002172         0                  16.72E-5)          //12
	(0.0027172     0                  16.72E-5)          //13
	(0                    2.5E-2                 16.72E-5)          //14
	(16.72E-5                   2.5E-2                 16.72E-5)          //15
	(0.0002172         2.5E-2                 16.72E-5)          //16
	(0.0027172     2.5E-2                 16.72E-5)          //17
	(0                    0.02525        16.72E-5)          //18
	(16.72E-5                   0.02525        16.72E-5)          //19
	//Extra corner block for U domain
	(0.0002172         0.02525        0)           //20
	(0.0027172     0.02525        0)           //21
	(0.0002172         0.02525        16.72E-5)          //22
	(0.0027172     0.02525        16.72E-5)          //23

);

blocks          
(
	hex ( 0  1  5  4 10 11 15 14) (50	    200    1) simpleGrading (1 1 1)       //00
	hex ( 1  2  6  5 11 12 16 15) (15    200   1) simpleGrading (1 1 1)       //01
	hex ( 2  3  7  6 12 13 17 16) (225   200    1) simpleGrading (5 1 1)       //02
	hex ( 4  5  9  8 14 15 19 18) (50	    23    1) simpleGrading (1 1 1)       //03
	hex ( 6  7 21 20 16 17 23 22) (225   23    1) simpleGrading (5 1 1)       //04

);

edges           
(
);

patches         
(
	wall VertWall 
	(
		( 0 10 14  4)
		( 4 14 18  8)
	)

	wall Vane
	(
		( 5 15 16  6)
		( 5  9 19 15)
		( 6 16 22 20)
	)

	patch FreeStream
	(
		( 3  7 17 13)
		( 7 21 23 17)
	)

	patch Inlet
	(
		( 8 18 19  9)
	)

	patch Top
	(
		(20 22 23 21)
	)

	patch Bottom
	(
		( 0  1 11 10)
		( 1  2 12 11)
		( 2  3 13 12)
	)

	empty Sides
	(
		( 0  4  5  1)
		( 1  5  6  2)
		( 2  6  7  3)
		( 4  8  9  5)
		(10 11 15 14)
		(11 12 16 15)
		(12 13 17 16)
		(14 15 19 18)
		( 6 20 21  7)
		(16 17 23 22)
	)	
);

mergePatchPairs 
();

// ************************************************************************* //
