interThermalPhaseFoam/tutorials/NusseltSmooth/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
64325
(
(0 -0.00979217 0)
(0 -0.0290813 0)
(0 -0.0479767 0)
(0 -0.0664785 0)
(0 -0.0845866 0)
(0 -0.102301 0)
(0 -0.119622 0)
(0 -0.136549 0)
...
)
;

boundaryField
{
    VertWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Vane
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    FreeStream
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            groovyBC;
        refValue        uniform (0 0 0);
        refGradient     uniform (0 0 0);
        valueFraction   uniform 1;
        value           uniform (0 0 0);
        valueExpression "vector(0,-(3*Gamma/(rho_l*d_f))*((pos().x/d_f)-0.5*pow(pos().x/d_f,2)),0)";
        gradientExpression "vector(0,0,0)";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       "";
        timelines       (
);
        lookuptables    (
);
        globalScopes    1(globalVars)
;
    }
    Top
    {
        type            zeroGradient;
    }
    Bottom
    {
        type            zeroGradient;
    }
    Sides
    {
        type            empty;
    }
}


// ************************************************************************* //
