interThermalPhaseFoam/tutorials/NusseltSmooth/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//H is actually calculated automatically during operation, no need to do anything here, I guess...

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    VertWall
    {
        type            zeroGradient;
    }

    Vane
    {
        type            zeroGradient;
    }

	Inlet
	{
		type    groovyBC;
        globalScopes ( "globalVars" );
		valueExpression  "(T-T_sat)*cp_l";
		value           uniform 0;
    }

    FreeStream
    {
        type            zeroGradient;
    }

    Top
    {
        type            zeroGradient;
    }

    Bottom
    {
        type            zeroGradient;
    }

    Sides
    {
        type            empty;
    }
}


// ************************************************************************* //
