interThermalPhaseFoam/tutorials/NusseltSmooth/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
64325
(
293.05
293.15
293.25
293.35
293.45
293.55
293.65
293.75
...
)
;

boundaryField
{
    VertWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    Vane
    {
        type            zeroGradient;
    }
    FreeStream
    {
        type            fixedValue;
        value           uniform 298;
    }
    Inlet
    {
        type            groovyBC;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 0;
        valueExpression "T_w+(T_sat-T_w)*(pos().x/d_f)";
        gradientExpression "0";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       "";
        timelines       (
);
        lookuptables    (
);
        globalScopes    1(globalVars)
;
    }
    Top
    {
        type            fixedValue;
        value           uniform 298;
    }
    Bottom
    {
        type            zeroGradient;
    }
    Sides
    {
        type            empty;
    }
}


// ************************************************************************* //
