interThermalPhaseFoam/tutorials/NusseltSmooth/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
64325
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    VertWall
    {
        type            constantAlphaContactAngle;
        gradient        uniform 0;
        limit           gradient;
        theta0          20;
        value           uniform 0;
    }
    Vane
    {
        type            zeroGradient;
    }
    FreeStream
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    Top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    Bottom
    {
        type            zeroGradient;
    }
    Sides
    {
        type            empty;
    }
}


// ************************************************************************* //
