interThermalPhaseFoam/tutorials/NusseltSmooth/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cell;

setFormat       raw;

sets
(
    //CenterLine
    //{
    //    type    face;
    //    axis    x;
    //    start   ( 0     0.05 0.0005 );
    //    end     ( 0.004 0.05 0.0005 );
    //    nPoints 100;
    //}
);

setFormat       raw;
surfaceFormat	raw;

surfaces
(
    Phase
    {
        type            plane;    // always triangulated
        basePoint       (0 0 0.0005);
        normalVector    (0 0 1);
    }
);

fields          ( alpha1 T );


// ************************************************************************* //
